&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ОтветСервера.Высота = ?(ЗначениеЗаполнено(Запись.ОтветСервера), 0, 1);
	//Элементы.Пояснение.Высота = ?(ЗначениеЗаполнено(Запись.Пояснение), 0, 1);
	Элементы.ОписаниеОшибки.Высота = ?(ЗначениеЗаполнено(Запись.ОписаниеОшибки), 0, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветСервераПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОшибкиПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры