
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Бот = Параметры.Бот;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Бот) Тогда
		БотыБот = Новый ПолеКомпоновкиДанных("Боты.Бот");
		НастройкиСписка = Список.КомпоновщикНастроек.Настройки;
		ОтборБот = Неопределено;
		Для Каждого ЭлементОтбора Из НастройкиСписка.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = БотыБот Тогда
				ОтборБот = ЭлементОтбора;
			КонецЕсли;
		КонецЦикла;
		Если ОтборБот <> Неопределено Тогда
			ОтборБот.Использование = Истина;
			ОтборБот.ПравоеЗначение = Бот;
			Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСписка);
		КонецЕсли;
		Бот = Неопределено;
	КонецЕсли;
	
КонецПроцедуры