
&НаКлиенте
Процедура КодКлавиатурыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Попытка
		Href = ДанныеСобытия.Href;
	Исключение
		Href = Неопределено;
	КонецПопытки;
	Если ЗначениеЗаполнено(Href) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТелеграмОбработки.ФормаСписка", , ЭтаФорма, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КодКлавиатуры = ТелеграмКлиент.РаскраситьКод(Параметры.КодКлавиатуры);	
	
КонецПроцедуры
