

Процедура ЗаписатьНовыйОбъектПользователя(Бот, ЧатПользователь, ОбъектСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмОбъектыПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЧатПользователь = ЧатПользователь;
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.ДатаЗагрузки = ТекущаяДата();
	МенеджерЗаписи.Ссылка = ОбъектСсылка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры



Процедура ОбновитьСсылкуОбъектаПользователя(СтараяСсылка, НоваяСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмОбъектыПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = СтараяСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Ссылка = НоваяСсылка;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры
