// Возвращает Истина, если клиентское приложение запущено под управлением ОС Windows.
//
// Возвращаемое значение:
//  Булево. Если нет клиентского приложения, возвращается Ложь.
//
&НаКлиенте
Функция ЭтоWindowsКлиент() Экспорт
	
#Если Клиент Или ВнешнееСоединение Тогда
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЭтоWindowsКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
#Иначе
	ЭтоWindowsКлиент = Ложь;
#КонецЕсли
	
	Возврат ЭтоWindowsКлиент;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЭмодзи = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ТелеграмЭмодзи);
	ВсеЭмодзи = РегистрыСведений.ТелеграмЭмодзи.ПолучитьМакет("emj_png_htm").ПолучитьТекст();
	ВсеЭмодзи = СтрШаблон(ВсеЭмодзи, АдресЭмодзи);
	Атлас = РегистрыСведений.ТелеграмЭмодзи.ПолучитьМакет("atlas_htm").ПолучитьТекст();
	Атлас = СтрШаблон(Атлас, АдресЭмодзи);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНаСервере()
	
	РегистрыСведений.ТелеграмЭмодзи.Инициализировать();
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализировать(Команда)
	
	ИнициализироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьВБуферОбмена(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЭтоWindowsКлиент() Тогда
			ComОбъект = Новый COMОбъект("htmlfile");
			ComОбъект.ParentWindow.ClipboardData.Setdata("Text", ТекущиеДанные.АльфаКод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры