Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТелеграмМетоды.Код КАК Код
		|ИЗ
		|	Справочник.ТелеграмМетоды КАК ТелеграмМетоды
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			Попытка
				КодЧ = Число(Выборка.Код);
			Исключение
				КодЧ = 0;
			КонецПопытки;
			
			Если КодЧ > 0 Тогда
				КодЧ = КодЧ - КодЧ % 10;
				КодЧ = КодЧ + 10;
				Код = Формат(КодЧ, "ЧЦ=9; ЧВН=; ЧГ=");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры
