Функция ЗначениеУсловия(Условие, ВходящееОбновление) Экспорт
	
	Ответ = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Условие", Условие);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмУсловия.Предопределенный,
	|	ТелеграмУсловия.ИмяПредопределенныхДанных КАК Имя,
	|	ТелеграмУсловия.КодОтвета
	|ИЗ
	|	ПланВидовХарактеристик.ТелеграмУсловия КАК ТелеграмУсловия
	|ГДЕ
	|	ТелеграмУсловия.Ссылка = &Условие";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Предопределенный Тогда
		Если Выборка.Имя = "Команда" Тогда
			Ответ = ТелеграмСервер.Сущность(ВходящееОбновление, "bot_command");
		ИначеЕсли Выборка.Имя = "Сообщение" Тогда
			Ответ = ТелеграмСервер.Сообщение(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "ОтветКонтекстнойКлавиатуры" Тогда
			Ответ = ТелеграмСервер.ОтветКонтекстнойКлавиатуры(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "Упоминание" Тогда
			Ответ = ТелеграмСервер.Сущность(ВходящееОбновление, "mention");
		ИначеЕсли Выборка.Имя = "Хэштег" Тогда
			Ответ = ТелеграмСервер.Сущность(ВходящееОбновление, "hashtag");
		ИначеЕсли Выборка.Имя = "Ссылка" Тогда
			Ответ = ТелеграмСервер.Сущность(ВходящееОбновление, "url");
		ИначеЕсли Выборка.Имя = "ЭлектроннаяПочта" Тогда
			Ответ = ТелеграмСервер.Сообщение(ВходящееОбновление, "email");
		ИначеЕсли Выборка.Имя = "ТелефонныйНомер" Тогда
			Ответ = ТелеграмСервер.Сообщение(ВходящееОбновление, "phone_number");
		ИначеЕсли Выборка.Имя = "Подпись" Тогда
			Ответ = ТелеграмСервер.Подпись(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитФотографии" Тогда
			Ответ = ТелеграмСервер.СодержитФотографии(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "КоличествоФотографий" Тогда
			Ответ = ТелеграмСервер.КоличествоФотографий(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитДокумент" Тогда
			Ответ = ТелеграмСервер.СодержитДокумент(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитВидео" Тогда
			Ответ = ТелеграмСервер.СодержитВидео(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитВидеозаметку" Тогда
			Ответ = ТелеграмСервер.СодержитВидеозаметку(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитАудио" Тогда
			Ответ = ТелеграмСервер.СодержитАудио(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитКонтакт" Тогда
			Ответ = ТелеграмСервер.СодержитКонтакт(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитМестоположение" Тогда
			Ответ = ТелеграмСервер.СодержитМестоположение(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитМестоНаКарте" Тогда
			Ответ = ТелеграмСервер.СодержитМестоНаКарте(ВходящееОбновление);
		ИначеЕсли Выборка.Имя = "СодержитГолосовоеСообщение" Тогда
			Ответ = ТелеграмСервер.СодержитГолосовоеСообщение(ВходящееОбновление);
		КонецЕсли;
	Иначе
		Ответ = ТелеграмСервер.ВыполнитьКодСОтветом(Выборка.КодОтвета, ВходящееОбновление);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции