
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Подсказка = Подсказка(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Подсказка(Ссылка)
	
	ИндексСсылки = Перечисления.ТелеграмСпециальныеОбработки.Индекс(Ссылка);
	ИмяМакета = Метаданные.Перечисления.ТелеграмСпециальныеОбработки.ЗначенияПеречисления[ИндексСсылки].Имя;	
	Подсказка = Перечисления.ТелеграмСпециальныеОбработки.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	Возврат Подсказка;
	
КонецФункции
