&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СервисыОбработки(Параметры.Обработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СервисыОбработки(Обработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Обработка", Обработка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелеграмСервисыОбработки.Ссылка
	|ИЗ
	|	Справочник.ТелеграмСервисы.Обработки КАК ТелеграмСервисыОбработки
	|ГДЕ
	|	ТелеграмСервисыОбработки.Обработка = &Обработка";

	МассивОбработок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокОбработок = Новый СписокЗначений;
	СписокОбработок.ЗагрузитьЗначения(МассивОбработок);
	Возврат СписокОбработок;
	
КонецФункции