
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РеквизитПоляТекстовогоДокумента = "Фрагмент";
	ЭлементПоляТекстовогоДокумента = "Фрагмент";
	ОбновитьФрагментHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФрагментHTML()
	
	ФрагментHTML = ТелеграмКлиент.РаскраситьКод(Объект.Фрагмент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаОсновная Тогда
		ОбновитьФрагментHTML();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Форматировать(Команда)
	Объект.Фрагмент = ТелеграмКлиент.ФорматироватьСтроку(Объект.Фрагмент);
КонецПроцедуры

