
Функция СгенерироватьНовыйИнвайтПользователя(МассивПараметровВыдать, МассивПараметровЗабрать, ЧатПользователь = Неопределено) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ДобавитьРазрешения = Новый ХранилищеЗначения(МассивПараметровВыдать, Новый СжатиеДанных(9));
	МенеджерЗаписи.УбратьРазрешения = Новый ХранилищеЗначения(МассивПараметровЗабрать, Новый СжатиеДанных(9));
	МенеджерЗаписи.ДатаВыдачи = ТекущаяДата();
	МенеджерЗаписи.ТекстИнвайта = "/invite " + МенеджерЗаписи.Инвайт;
	МенеджерЗаписи.КтоВыдал = ?(ЧатПользователь = Неопределено, Пользователи.ТекущийПользователь(),ЧатПользователь);
	
	МенеджерЗаписи.Записать();
	
	
	Возврат МенеджерЗаписи.ТекстИнвайта;
	
КонецФункции

Процедура ЗаполнитьМассивыРазрешенийИзЗаписиИнвайта(МассивПараметровВыдать, МассивПараметровЗабрать, УникальныйИдентификатор) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		
		МассивПараметровВыдать = МенеджерЗаписи.ДобавитьРазрешения.Получить();	
		МассивПараметровЗабрать = МенеджерЗаписи.УбратьРазрешения.Получить();
		
	КонецЕсли;
	
		
КонецПроцедуры

Функция ПроверитьДоступностьИнвайта(УникальныйИдентификатор) Экспорт
	
	Доступен = Ложь;	
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Доступен = НЕ МенеджерЗаписи.Активирован;		
	КонецЕсли;
	
	Возврат Доступен;
		
КонецФункции

Функция ПроизвестиПопыткуАктивироватьИнвайт(Активирован, ЧатПользователь, УникальныйИдентификатор, МассивПараметровВыдать, МассивПараметровЗабрать) Экспорт
	
	Активирован = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмИнвайты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инвайт = УникальныйИдентификатор;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если НЕ МенеджерЗаписи.Активирован Тогда
			МенеджерЗаписи.Активирован = Истина;
			МенеджерЗаписи.ДатаАктивации = ТекущаяДата();
			МенеджерЗаписи.КтоАктивировал = ЧатПользователь;
			
			МенеджерЗаписи.Записать();
			
			Активирован = Истина;
			МассивПараметровВыдать = МенеджерЗаписи.ДобавитьРазрешения.Получить();	
			МассивПараметровЗабрать = МенеджерЗаписи.УбратьРазрешения.Получить();
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецФункции


