&НаКлиенте
Процедура ПроцедурыПолучения(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПроцедурыПолученияНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПроцедурыПолученияНаСервере(ТабличныйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмМетодыПараметры.Параметр
	|ИЗ
	|	Справочник.ТелеграмМетоды.Параметры КАК ТелеграмМетодыПараметры
	|ГДЕ
	|	ТелеграмМетодыПараметры.ЕстьПроцедура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТелеграмМетодыПараметры.Ссылка.Код,
	|	ТелеграмМетодыПараметры.НомерСтроки";
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультата.Свернуть("Параметр");
	ТаблицаРезультата.Колонки.Добавить("Процедура", Новый ОписаниеТипов("Булево"));
	
	Для Каждого ТекущаяСтрока Из ТаблицаРезультата Цикл
		ТекущаяСтрока.Процедура = ТелеграмСервер.ЕстьПроцедураПолучения(ТекущаяСтрока.Параметр);
	КонецЦикла;
	
	ПОТ = Новый ПостроительОтчета;
	ПОТ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаРезультата);
	ПОТ.Выполнить();
	ПОТ.ТекстЗаголовка = "Процедуры получения параметров";
	ПОТ.Вывести(ТабличныйДокумент);
	
КонецПроцедуры