Процедура ОбновитьСтатистику(Бот, Чат, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмСтатистика.Принято
	|ИЗ
	|	РегистрСведений.ТелеграмСтатистика КАК ТелеграмСтатистика
	|ГДЕ
	|	ТелеграмСтатистика.Бот = &Бот
	|	И ТелеграмСтатистика.Чат = &Чат
	|	И ТелеграмСтатистика.Пользователь = &Пользователь";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Принято = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Принято = Выборка.Принято;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ТелеграмСтатистика.СоздатьМенеджерЗаписи();
	МЗ.Бот = Бот;
	МЗ.Чат = Чат;
	МЗ.Пользователь = Пользователь;
	МЗ.Принято = Принято + 1;
	МЗ.Обновлено = ТекущаяДата();
	МЗ.Записать();
	
КонецПроцедуры