Процедура ПриЗаписи(Отказ)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ВыключитьРегламентноеЗадание = Ложь;
	ДополнительныеСвойства.Свойство("ВыключитьРегламентноеЗадание", ВыключитьРегламентноеЗадание);
	Если ВыключитьРегламентноеЗадание = Истина Тогда
		МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(
			Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ТелеграмПолучениеОбновлений));
		Для Каждого Задание Из МассивЗаданий Цикл
			Если Задание.Параметры.Количество() > 0 И Задание.Параметры[0] = Ссылка Тогда
				Задание.Использование = Ложь;
				Задание.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда
		Используется = Ложь;
	КонецЕсли;
	
	Если ПометкаУдаления
		ИЛИ НЕ Используется
		ИЛИ СпособСвязи <> Перечисления.ТелеграмСпособыСвязи.РегламентноеЗадание Тогда
		ДополнительныеСвойства.Вставить("ВыключитьРегламентноеЗадание", Истина);
	КонецЕсли;
	
КонецПроцедуры