
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТелеграмТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверкаЗагрузкиСправочныхДанных", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗагрузкиСправочныхДанных()
	
	Если НЕ ЗначениеЗаполнено(ТелеграмТекущаяВерсия) Тогда
		
		ТекстНеЗагруженыПервоначальныеДанные = ТекстНеЗагруженыПервоначальныеДанные();
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Заголовок", "Не загружены первоначальные данные");
		СтруктураПараметров.Вставить("Сообщение", ТекстНеЗагруженыПервоначальныеДанные);
		СтруктураПараметров.Вставить("ХТМЛ", Истина);
		ОткрытьФорму("Справочник.ТелеграмБоты.Форма.ФормаСообщения", 
			СтруктураПараметров, 
			ЭтаФорма, 
			УникальныйИдентификатор,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстНеЗагруженыПервоначальныеДанные()
	
	Возврат Справочники.ТелеграмБоты.ПолучитьМакет("НеЗагруженыПервоначальныеДанные").ПолучитьТекст();
	
КонецФункции