&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФорматнаяСтрока = ПараметрыВыполненияКоманды.
		Источник.Элементы[ПараметрыВыполненияКоманды.
		Источник.ЭлементПоляТекстовогоДокумента].ВыделенныйТекст;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КонструкторФорматнойСтроки", ТелеграмКлиент, СтруктураПараметров);
	
	Если ЗначениеЗаполнено(ФорматнаяСтрока) Тогда
		Попытка
			КонструкторФорматнойСтроки = Новый КонструкторФорматнойСтроки(ФорматнаяСтрока);
			ФорматнаяСтрокаВалидная = Истина;
		Исключение
			ФорматнаяСтрокаВалидная = Ложь;
		КонецПопытки;
	Иначе
		ФорматнаяСтрокаВалидная = Истина;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ФорматнаяСтрока", ФорматнаяСтрока);
	СтруктураПараметров.Вставить("ФорматнаяСтрокаВалидная", ФорматнаяСтрокаВалидная);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры