Функция ОграниченныйДоступ(НастройкиБота, Пользователь) Экспорт
	
	Если НЕ НастройкиБота.ОграниченныйДоступ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Бот", НастройкиБота.Бот);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмЧатыПользователиБоты.НомерСтроки
	|ИЗ
	|	Справочник.ТелеграмЧатыПользователи.Боты КАК ТелеграмЧатыПользователиБоты
	|ГДЕ
	|	ТелеграмЧатыПользователиБоты.Ссылка = &Пользователь
	|	И ТелеграмЧатыПользователиБоты.Бот = &Бот";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции