&НаКлиенте
Процедура Используется(Команда)
	
	ВклВыклИспользуется(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НеИспользуется(Команда)
	
	ВклВыклИспользуется(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВклВыклИспользуется(ВклВыкл)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ВклВыклИспользуетсяСервер(ВыделеннаяСтрока, ВклВыкл);
	КонецЦикла;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ВклВыклИспользуетсяСервер(Ссылка, ВклВыкл)
	
	СпрОб = Ссылка.ПолучитьОбъект();
	Если НЕ СпрОб.ЭтоГруппа Тогда
		СпрОб.Используется = ВклВыкл;
		СпрОб.Записать();
	КонецЕсли;
	
КонецПроцедуры